In [1]:
# 판다스의 전역함수로 DataFrame 로딩하기 

!type c:\work\csv_mindex.csv

key1,key2,value1,value2
mobile, ios, 100, 200
mobile, android, 200, 500
mobile, bada, 5, 10
mobile, tizen, 150, 250
notebook, ios, 11, 12
notebook, android, 22, 33
notebook, bada, 50, 60
notebook, tizen, 300, 400

In [3]:
!type c:\work\ex1.csv

id, name, price, description
1, iphone, 890000, iphone 6s 7 8 x
2, android, 990000, samsung phone
3, winphone, 450000, microsoft winphone

In [4]:
!type c:\work\ex2.csv

1, iphone, 890000, iphone 6s 7 8 x
2, android, 990000, samsung phone
3, winphone, 450000, microsoft winphone

In [5]:
!type c:\work\ex3.csv

data1 data2 data3
1.2 2.3 1.3
0.1 1.5 2.5
3.1 3.2 3.3

In [6]:
import pandas as pd

df = pd.read_csv("C:\work\ex1.csv")
df

C:\Users\kimjh\AppData\Local\Temp\ipykernel_20812\1780712397.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

   id       name   price           description
0   1     iphone  890000      iphone 6s 7 8 x
1   2    android  990000         samsung phone
2   3   winphone  450000   microsoft winphone

In [7]:
import pandas as pd

df = pd.read_csv("C:\work\ex2.csv")
df

   1     iphone   890000      iphone 6s 7 8 x
0  2    android   990000         samsung phone
1  3   winphone   450000   microsoft winphone

In [8]:
import pandas as pd

df = pd.read_csv("C:\work\ex3.csv")
df

  data1 data2 data3
0        1.2 2.3 1.3
1        0.1 1.5 2.5
2        3.1 3.2 3.3

In [9]:
import pandas as pd

df = pd.read_csv("C:\work\ex2.csv")
df

   1     iphone   890000      iphone 6s 7 8 x
0  2    android   990000         samsung phone
1  3   winphone   450000   microsoft winphone

In [10]:
df2 = pd.read_csv("c:\\work\\ex2.csv",
                  names=["id", "name", "price", "desc"])
df

   1     iphone   890000      iphone 6s 7 8 x
0  2    android   990000         samsung phone
1  3   winphone   450000   microsoft winphone

In [11]:
!type ex3.txt

data1 data2 data3
1.2     2.3     1.3
0.1     1.5     2.5
3.1     3.2     3.3

In [14]:
df3 = pd.read_csv("c:\\work\\ex3.csv", sep="/s+")
df

C:\Users\kimjh\AppData\Local\Temp\ipykernel_20812\334929945.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df3 = pd.read_csv("c:\\work\\ex3.csv", sep="/s+")

   1     iphone   890000      iphone 6s 7 8 x
0  2    android   990000         samsung phone
1  3   winphone   450000   microsoft winphone

In [15]:
!type c:\work\ex4.csv

������ ������ ã�� �� �����ϴ�.

In [16]:
!type c:\work\ex3.txt

data1 data2 data3
1.2     2.3     1.3
0.1     1.5     2.5
3.1     3.2     3.3

In [19]:
df3 = pd.read_csv("c:\\work\\ex3.txt", sep="\s+")
df

   1     iphone   890000      iphone 6s 7 8 x
0  2    android   990000         samsung phone
1  3   winphone   450000   microsoft winphone